In [2]:
joy=['toy',1,5,7]

In [4]:
joy.append(65)

In [5]:
print(joy)

['toy', 1, 5, 7, 65, 65]

In [9]:
joy[0]

'toy'

In [10]:
joy.insert(5,'pagalpanti')

In [11]:
print(joy)

['toy', 1, 5, 7, 65, 'pagalpanti', 65]

In [12]:
joy.append([5,6])

In [13]:
print(joy)

['toy', 1, 5, 7, 65, 'pagalpanti', 65, [5, 6]]

In [14]:
joy.extend([4,8])

In [15]:
print(joy)

['toy', 1, 5, 7, 65, 'pagalpanti', 65, [5, 6], 4, 8]

In [11]:
yoj = [4,8,8,7,63,4]

In [18]:
sum(yoj)

94

In [19]:
yoj.count(1)

0

In [9]:
yoj.pop()

4

In [12]:
yoj

[4, 8, 8, 7, 63, 4]

In [8]:
yoj.index(7,0,6)

3

In [21]:
yoj*2

[4, 8, 8, 7, 63, 4, 4, 8, 8, 7, 63, 4]

In [22]:
uou={1,2,3,4,5,1}

In [44]:
print(uou)

set()

In [24]:
type(uou)

set

In [45]:
uou.add(55)

In [49]:
tou={1,2,3,5,9}
go={1,5,6,3}
tou.intersection(go)

{1, 3, 5}

In [50]:
print(tou)

{1, 2, 3, 5, 9}

In [52]:
tou.intersection_update(go)

In [53]:
print(tou)

{1, 3, 5}

In [28]:
ooo = {'ttt': 'joy', 'ttt1' : 'toy' , 'ttt2' : 'boy'}
type(ooo)

dict

In [34]:
p=list(ooo)
g=p[0]
print(ttt
     )

[1, 5, 3, 8]

In [56]:
ooo['ttt3'] = 'soy'

In [57]:
print(ooo)

{'ttt': 'joy', 'ttt1': 'toy', 'ttt2': 'boy', 'ttt3': 'soy'}

In [59]:
ooo['ttt']='hoy'
print(ooo)

{'ttt': 'hoy', 'ttt1': 'toy', 'ttt2': 'boy', 'ttt3': 'soy'}

In [80]:
ooo = {'ttt': 'joy'}
ooo1= {'ttt1' : 'toy'}
ooo2={'ttt2': 'boy'}
hood={ooo: 'hood1', ooo1: 'hood2' , ooo2: 'hood3'}

TypeError: unhashable type: 'dict'

In [73]:
print(hood)

{'ooo': 'hood1', 'ooo1': 'hood2', 'ooo2': 'hood3'}

In [6]:
ooo = {'ttt': 'joy'}
ooo1= {'ttt1' : 'toy'}
ooo2={'ttt2': 'boy'}
hood={'hood1': ooo, 'hood2': ooo1 , 'hood3': ooo2}
print(hood)

{'hood1': {'ttt': 'joy'}, 'hood2': {'ttt1': 'toy'}, 'hood3': {'ttt2': 'boy'}}

In [12]:
print(hood['hood1'] ['ttt'])

joy

In [18]:
a={'b':'c'}
d={'e':'f'}
g={'h':a,'i':d}
print(g)
print(g['h']['b'])

{'h': {'b': 'c'}, 'i': {'e': 'f'}}
c

In [29]:
print(uou)

{1, 2, 3, 4, 5, 55}

In [31]:
yoy={3,4,1}

In [32]:
uou.difference(yoy)

{2, 5, 55}

In [43]:
print(uou)
uou.intersection(yoy)

set()

set()

In [38]:
print(uou)

{2, 5, 55}

In [2]:
x='a'
print(x)

a

In [121]:
import numpy as np

In [9]:
joy=[1,2,3,4]
yoj=np.array(joy)
type(yoj)
yoj

array([1, 2, 3, 4])

In [13]:
yoj.shape

(4,)

In [15]:
poo=[1,2,3,5]
ttt=[1,5,3,8]
yyy=[5,6,4,2]
yod=np.array([poo,ttt,yyy])
yod

array([[1, 2, 3, 5],
       [1, 5, 3, 8],
       [5, 6, 4, 2]])

In [16]:
yod.shape

(3, 4)

In [14]:
poo=[1,2,3,5]
ttt=[1,5,3,8]
yyy=[5,6,4,2]
yod=np.array([poo,ttt,yyy])
yod

array([[1, 2, 3, 5],
       [1, 5, 3, 8],
       [5, 6, 4, 2]])

In [17]:
yod.shape

(3, 4)

In [20]:
yod.reshape(4,3)

array([[1, 2, 3],
       [5, 1, 5],
       [3, 8, 5],
       [6, 4, 2]])

In [21]:
arr=np.array([1,2,3,4,5,6])

In [24]:
arr.reshape(3,2)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [25]:
arr[2]

3

In [26]:
arr

array([1, 2, 3, 4, 5, 6])

In [27]:
yod

array([[1, 2, 3, 5],
       [1, 5, 3, 8],
       [5, 6, 4, 2]])

In [35]:
yod[0:2,0:2]

array([[1, 2],
       [1, 5]])

In [36]:
yod[1:,2:4]

array([[3, 8],
       [4, 2]])

In [38]:
joy=np.arange(0,22)
joy

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21])

In [40]:
joy=np.linspace(1,10,50)

In [42]:
np.linspace(1,10,50)

array([ 1.        ,  1.18367347,  1.36734694,  1.55102041,  1.73469388,
        1.91836735,  2.10204082,  2.28571429,  2.46938776,  2.65306122,
        2.83673469,  3.02040816,  3.20408163,  3.3877551 ,  3.57142857,
        3.75510204,  3.93877551,  4.12244898,  4.30612245,  4.48979592,
        4.67346939,  4.85714286,  5.04081633,  5.2244898 ,  5.40816327,
        5.59183673,  5.7755102 ,  5.95918367,  6.14285714,  6.32653061,
        6.51020408,  6.69387755,  6.87755102,  7.06122449,  7.24489796,
        7.42857143,  7.6122449 ,  7.79591837,  7.97959184,  8.16326531,
        8.34693878,  8.53061224,  8.71428571,  8.89795918,  9.08163265,
        9.26530612,  9.44897959,  9.63265306,  9.81632653, 10.        ])

In [46]:
joy[0:3,]=500
joy

array([500., 500., 500., 500., 500., 500., 500., 500., 500., 500., 500.,
       500., 500., 500., 500., 500., 500., 500., 500., 500., 500., 500.,
       500., 500., 500., 500., 500., 500., 500., 500., 500., 500., 500.,
       500., 500., 500., 500., 500., 500., 500., 500., 500., 500., 500.,
       500., 500., 500., 500., 500., 500.])

In [4]:
tty=np.arange(1,9)
tty[3:]=100
tty

array([  1,   2,   3, 100, 100, 100, 100, 100])

In [59]:
tty1=tty
tty1[3:]=500
tty1

array([  1,   2,   3, 500, 500, 500, 500, 500])

In [66]:
tty1=tty.copy()
print(tty)
tty1[2:]=1000
print(tty1)
print(tty)
tty[2:]=200
print(tty)

[  1   2 200 200 200 200 200 200]
[   1    2 1000 1000 1000 1000 1000 1000]
[  1   2 200 200 200 200 200 200]
[  1   2 200 200 200 200 200 200]

In [12]:
np.ones((2,5))

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [3]:
import pandas as pd
import numpy as np

In [38]:
df=pd.Dataframe(np.arange(0,6).reshape(3,2),index=['Joy1','Joy2','Joy3']),columns=['Toy1',"Toy2"])

SyntaxError: cannot assign to function call (4244041360.py, line 1)

In [6]:
jpoy=pd.DataFrame(np.arange(0,6).reshape(3,2),index=['Joy1','Joy2','Joy3'],columns=["Toy1","Toy2"])
type(jpoy)
joy.

pandas.core.frame.DataFrame

In [7]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["column1","column2","column3","column4"])

In [8]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [15]:
joy=pd.DataFrame(np.arange(0,6).reshape(3,2),index=['Joy1','Joy2','Joy3'],columns=["Toy1","Toy2"])

In [59]:
joy.head()

      Toy1  Toy2
Joy1     0     1
Joy2     2     3
Joy3     4     5

In [62]:
joy.to_csv('Joy')

In [14]:
joy

NameError: name 'joy' is not defined

In [16]:
type(df.iloc[3:5,2:4])

pandas.core.frame.DataFrame

In [20]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [101]:
joy

      Toy1  Toy2
Joy1     0     1
Joy2     2     3
Joy3     4     5

In [112]:
pd.__version__

'1.4.2'

In [49]:
from io import StringIO

In [50]:
joy=('cl2,cl2,cl3\n'
    'x,y,7\n'
    'k,i,8\n'
    'i,o,0')

In [51]:
type(joy)

str

In [52]:
StringIO(joy)

In [53]:
pd.read_csv(StringIO(joy))

  cl2 cl2.1  cl3
0   x     y    7
1   k     i    8
2   i     o    0

In [21]:
jpoy=pd.DataFrame(data=[[1,np.nan],[2,np.nan],[1,2]],index=['Joy1','Joy2','Joy3'],columns=["Toy1","Toy2"])
type(jpoy)

pandas.core.frame.DataFrame

In [22]:
jpoy

      Toy1  Toy2
Joy1     1   NaN
Joy2     2   NaN
Joy3     1   2.0

In [23]:
jpoy.isnull().sum()

Toy1    0
Toy2    2
dtype: int64

In [24]:
jpoy.isnull()

       Toy1   Toy2
Joy1  False   True
Joy2  False   True
Joy3  False  False

In [28]:
jpoy['Toy2'].value_counts()

2.0    1
Name: Toy2, dtype: int64

In [29]:
jpoy['Toy2'].unique

<bound method Series.unique of Joy1    NaN
Joy2    NaN
Joy3    2.0
Name: Toy2, dtype: float64>

In [43]:
df=pd.read_csv('Book1.csv',sep=";")

In [44]:
df

   Hoodie  Boat  Boat1  Boat2  Boat3  Boat4
0       1    45     11      2     75      1
1       2    48     18      2     72      0
2       3    51     25      5     69     -1

In [45]:
df[df['Boat1']>12]

   Hoodie  Boat  Boat1  Boat2  Boat3  Boat4
1       2    48     18      2     72      0
2       3    51     25      5     69     -1

In [79]:
df=pd.read_csv(StringIO(joy),dtype= 'object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cl2     3 non-null      object
 1   cl2.1   3 non-null      object
 2   cl3     3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [77]:
df.dtypes

cl2      object
cl2.1    object
cl3      object
dtype: object

In [95]:
fta=('a,b(j),b\n'
     '4,d\n'
     '5,h,j')

In [99]:
df=pd.read_csv(StringIO(fta),usecols=['a','b(j)','b'],index_col=1)

In [100]:
df

      a    b
b(j)
d     4  NaN
h     5    j

In [11]:
a = [4,2]
b = [4,2]
id(a)
id(b)

1928209765952

In [6]:
a==b

True

In [7]:
a is b

False

In [106]:
dd=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item' , sep='\t')

In [116]:
dd.iloc[0:5,0:4]

,item_code,item_name,display_level,selectable
0,AA0,All items - old base,0,T
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T
2,SA0,All items,0,T
3,SA0E,Energy,1,T
4,SA0L1,All items less food,1,T

In [128]:
data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}] ,"joy": "toy"}'

In [129]:
pd.read_json(data)

,employee_name,email,job_profile,joy
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop...",toy

In [134]:
jpoy=pd.DataFrame(data=[[1,np.nan],[2,np.nan],[1,2]],index=['Joy1','Joy2','Joy3'],columns=["Toy1","Toy2"])
jpoy

      Toy1  Toy2
Joy1     1   NaN
Joy2     2   NaN
Joy3     1   2.0

In [141]:
jpoy.to_json(orient='columns')

'{"Toy1":{"Joy1":1,"Joy2":2,"Joy3":1},"Toy2":{"Joy1":null,"Joy2":null,"Joy3":2.0}}'

In [143]:
jpoy.to_json(orient='index')

'{"Joy1":{"Toy1":1,"Toy2":null},"Joy2":{"Toy1":2,"Toy2":null},"Joy3":{"Toy1":1,"Toy2":2.0}}'

In [144]:
jpoy.to_json(orient='split')

'{"columns":["Toy1","Toy2"],"index":["Joy1","Joy2","Joy3"],"data":[[1,null],[2,null],[1,2.0]]}'

In [147]:
jpoy.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"Toy1","type":"integer"},{"name":"Toy2","type":"number"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"Joy1","Toy1":1,"Toy2":null},{"index":"Joy2","Toy1":2,"Toy2":null},{"index":"Joy3","Toy1":1,"Toy2":2.0}]}'

In [148]:
schema='{"schema":{"fields":[{"name":"index","type":"string"},{"name":"Toy1","type":"integer"},{"name":"Toy2","type":"number"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"Joy1","Toy1":1,"Toy2":null},{"index":"Joy2","Toy1":2,"Toy2":null},{"index":"Joy3","Toy1":1,"Toy2":2.0}]}'

In [149]:
pd.read_json(schema,orient='table')

      Toy1  Toy2
Joy1     1   NaN
Joy2     2   NaN
Joy3     1   2.0

In [139]:
joy= '{"hoy":{"hot": "jot", "pot": 2}}'

In [140]:
pd.read_json(joy)

     hoy
hot  jot
pot    2

In [173]:
data = [{"employee_name": "James", "email": "james@gmail.com", "job_profile": "Team Lead"}]

In [174]:
pd.json_normalize(data)

  employee_name            email job_profile
0         James  james@gmail.com   Team Lead

In [154]:
pata = [
    {
        "id": 1,
        "name": "Cole Volk",
        "fitness": {"height": 130, "weight": 60},
    },
    {"name": "Mark Reg", "fitness": {"height": 130, "weight": 60}},
    {
        "id": 2,
        "name": "Faye Raker",
        "fitness": {"height": 130, "weight": 60},
    },
]

In [163]:
pd.json_normalize(pata )

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60

In [164]:
oata = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]

In [172]:
pd.json_normalize(oata,"counties",["state","shortname",["info","governor"]])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [23]:
joy=pd.read_html("https://en.wikipedia.org/wiki/Mobile_country_code")

In [24]:
joy[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test network,Operational,any,NaN
1,1,1,TEST,Test network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"

In [11]:
toy=pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area#:~:text=All%20193%20member%20states%20of,the%20list%20in%20ranked%20order.")

In [22]:
toy[1]

,Rank,Country / Dependency,Total in km2 (mi2),Land in km2 (mi2),Water in km2 (mi2),% water,Notes
0,NaN,World,"510,072,000 (196,940,000)","148,940,000 (57,510,000)","361,132,000 (139,434,000)",70.8,NaN
1,1,Russia,"17,098,246 (6,601,670)","16,378,410 (6,323,740)","719,836 (277,930)",4.21,"The largest country in the world, which spans ..."
2,NaN,Antarctica,"14,200,000 (5,500,000)","14,200,000 (5,500,000)",0 (0),0,"13,916,000km2 (5,373,000sqmi) (98%) of the ..."
3,2,Canada[Note 1],"9,984,670 (3,855,100)","9,093,507 (3,511,023)","891,163 (344,080)",8.93,Largest English- and largest French-speaking c...
4,3/4,China,"9,596,961 (3,705,407)","9,326,410 (3,600,950)","270,550 (104,460)",2.82,"Largest country entirely in Asia, and second-l..."
...,...,...,...,...,...,...,...
259,NaN,Ashmore and Cartier Islands (Australia),5 (1.9),5 (1.9),0 (0),0,NaN
260,NaN,Spratly Islands (disputed),(<1.9),(<1.9),0 (0),0,NaN
261,NaN,Coral Sea Islands (Australia),(<1.2),(<1.2),0 (0),0,NaN
262,194,Monaco,2.02 (0.78),2.02 (0.78),0 (0),0,European microstate. Smallest country with a c...
263,195,Vatican City,0.49 (0.19),0.49 (0.19),0 (0),0,European microstate. Smallest country in the w...

In [25]:
Joy = '''<?xml version='1.0' encoding='utf-8'?>
<data xmlns="http://example.com">
 <row>
   <shape>square</shape>
   <degrees>360</degrees>
   <sides>4.0</sides>
   <firstname>Krish</firstname>
 </row>
 <row>
   <shape>circle</shape>
   <degrees>360</degrees>
   <sides/>
   <firstname/>
 </row>
 <row>
   <shape>triangle</shape>
   <degrees>180</degrees>
   <sides>3.0</sides>
   <firstname/>
 </row>
</data>'''

In [42]:
pd.read_xml(Joy)

      shape  degrees  sides firstname
0    square      360    4.0     Krish
1    circle      360    NaN      None
2  triangle      180    3.0      None

In [32]:
xml = '''<?xml version='1.0' encoding='utf-8'?>
<data>
  <row shape="square" degrees="360" sides="4.0" firstname="Krish"/>
  <row shape="circle" degrees="360" Pagal= "mahapagal"/>
  <row shape="triangle" degrees="180" sides="3.0" lastname="Naik"/>
</data>'''

In [33]:
pd.read_xml(xml)

      shape  degrees  sides firstname      Pagal lastname
0    square      360    4.0     Krish       None     None
1    circle      360    NaN      None  mahapagal     None
2  triangle      180    3.0      None       None     Naik

In [39]:
xml = '''<?xml version='1.0' encoding='utf-8'?>
<doc:data xmlns:doc="https://example.com">
  <doc:row>
    <doc:shape>square</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides>4.0</doc:sides>
  </doc:row>
  <doc:row>
    <doc:shape>circle</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides/>
  </doc:row>
  <doc:row>
    <doc:shape>triangle</doc:shape>
    <doc:degrees>180</doc:degrees>
    <doc:sides>3.0</doc:sides>
  </doc:row>
</doc:data>'''

In [46]:
jpy=pd.read_xml(xml,xpath=".//doc:row",namespaces={"doc": "https://example.com"})

In [47]:
jpy

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

In [48]:
jpy.to_xml('goo.xml')

In [49]:
import seaborn as sns

In [55]:
df= sns.load_dataset('tips')

In [61]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [57]:
import pickle

In [59]:
filename= 'joy.pkl'

In [64]:
pickle.dump(df,open(filename,'wb'))

In [68]:
pickle.load(open(filename,'rb')).head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [82]:
def welcome(): 
    return "jai ho"

In [83]:
msg= welcome()

In [84]:
print(msg)

jai ho

In [73]:
welcome()

jai ho

In [93]:
def even_odd_sum(lst):
    """
    Description: This function will add even and odd number in a list
    Return : This function will return the sum of even and odd number in a list
    """

    even_sum=0
    odd_sum=0
    for i in lst:
        if i%2==0:
            even_sum+=i
        else:
            odd_sum+=i
    return even_sum,odd_sum


a,b=even_odd_sum([1,2,3,45,6,677,7,8,8,54,4,3,5,6])
print(a,b)

88 741

In [2]:
class Car:
    pass

In [4]:
car1= Car()
car2= Car()

In [5]:
print(car1)

<__main__.Car object at 0x00000199F2CB1580>

def __init__(self,windows,tyres,engine)

In [15]:
class Car:
    def __init__(self,windows,tyres,engine):
         self.windows=windows
         self.tyres=tyres
         self.engine=engine

In [16]:
car1=Car(8,5,"diesel")

In [20]:
print("the no of tyres in car1 is {}" .format(car1.tyres))

the no of tyres in car1 is 5

In [42]:
class animal:
    def __init__(self,*args):
        if len(args)==1 :
            self.name= args[0]
        elif len(args)==2:
            self.name=args[0]
            self.species=args[1]
        elif len(args)==3:
             self.name=args[0]
             self.species=args[1]
             self.age=args[2]

In [44]:
dog=animal("lara",5)

In [45]:
dog.name

'lara'

In [47]:
dog.species

5

In [48]:
class Car:
    def __init__(self,windows,doors,enginetype):
        self.windows=windows
        self.doors=doors
        self.enginetype=enginetype

    def driving(self):
        print("Car is ued for driving")

##Audi car is inherting from Car class
class Audi(Car):
    def __init__(self,windows,doors,enginetype,horsepower):
        super().__init__(windows,doors,enginetype)
        self.horsepower=horsepower

    def selfdriving(self):
        print("IT is a self driving car")


audiq7=Audi(4,5,"Diesel",200)

print(audiq7.horsepower)
print(audiq7.windows)
audiq7.driving()
audiq7.selfdriving()

car1=Car(4,5,"Diesel")
print(car1)
print(audiq7)

print(dir(audiq7))
print(dir(car1))

200
4
Car is ued for driving
IT is a self driving car
<__main__.Car object at 0x00000199F3DA17C0>
<__main__.Audi object at 0x00000199F3F61D60>
['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'doors', 'driving', 'enginetype', 'horsepower', 'selfdriving', 'windows']
['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'doors', 'driving', 'enginetype', 'windows']